Repository: ANamelessWolf/RivieraModulador
Catalog: ModEnfasisPlus/NamelessOld/Libraries/Yggdrasil/Resources/Errors.*.resx
Languages: es

# BadDecrypting
source: Something goes wrong trying to decrypt the string.
es: Algo salio mal al tratar de desencriptar la cadena.

# BadEncrypting
source: Something goes wrong trying to encrypt the string.
es: Algo salio mal al tratar de encriptar la cadena.

# ConfigCategoryDoesNotExist
source: The category {0} does not exist
es: La categoría {0} no existe

# ConfigDoesNotExist
source: The property {0} does not exist on the category {1}
es: La categoría {0} no existe en el nodo seleccionado {1}.

# DownloadImage
source: The image can not be downloaded from the given URL: {0}
es: No se puede descargar la imagen con la URL: {0}

# DoWorkError
source: An error occurrs on the frau thred with PID: {0} while working.
es: Un error ha ocurrido en el hilo con PID: {0} mientras ejecutaba el proceso de trabajo.

# EmptyStringCrypto
source: Can not encrypt or decrypt an empty string
es: No se puede encriptar o desencriptar una cadena vacia.

# MissingDirectory
source: The directory "{0}" does not exists.
es: El directorio "{0}" no existe.

# SavingFile
source: Error saving the file
es: Error al guardar el archivo

# XAttributeExist
source: The XAttribute "{0}", already exist on the node "{1}".
es: El XAttribute {0}, ya es parte del nodo {1}.

# XElementExist
source: The XElement "{0}", already exist on the node "{1}".
es: El XElement {0}, ya es parte del nodo {1}.

# XmlAttNameNotExist
source: The attribute name "{0}" does not exist in the node "{1}".
es: El nombre de atributo {0} no existe en el nodo {1}.

# XmlExportNode
source: Error exporting xml node {0}.
es: Error al exportar el nodo xml {0}.

# XmlFileDoesNotExists
source: The Xml file {0} doesn't exists, before using this class be sure that the file exists.
es: El archivo xml {0} no existe, antes de utilizar esta clase asegurese que el archivo exista.

# XmlNodeNameNotExist
source: The node "{0}" does not exist in the node "{1}".
es: El nodo {0} no existe en el nodo {1}.

# XmlNodeOutOfBounds
source: The index "{0}" is out of bounds
es: El indice "{0}" supera el tamaño de la colección de nodos.

# XmlParentNodeIsNull
source: Can not access the parent node, because is null.
es: No se puede acceder al padre del elemento, por qué es nulo.

# CanNotReadWikiFormat
source: The line format doesn't match the wikipedia format.
es: El formato de línea no coincide con un formato de línea de Wikipedia.

# EmptyDirectory
source: The selected directory has no files on it.
es: El directorio seleccionado esta vacio.

# PathToLong
source: The path is too long to access the file.
es: La dirección proporcionada es demasiado grande para acceder al archivo.

# RenamerSizeNotMatch
source: Can't rename the files beacuse the number of names doesn't match the size of the files.
es: No se puede renombrar la lista proporcionada. Ya que el tamaño de nombres no coincide con el número de archivos a renombrar.

# RootDirectoryMissing
source: The root directory "{0}" does not exists, the scanner needs an existant directory.
es: El directorio raíz "{0}" no se encontró. El escaner no puede buscar en un directorio que no existe.

# UnAuthorizedAccess
source: You don't have access to this file or directory. Restriction found in this direction "{0}".
es: No tienes permisos para acceder a este directorio. Modifica los permisos de la aplicación para poder acceder a esta dirección "{0}".

# ColumnDifferentSize
source: The input data has a different size for the defined columns
es: El tamaño de la información no coincide con el número de columnas definidas

# FileNotFound
source: The file does not exists, or is not accessible.
es: El archivo no existe o no es accesible.

# AssemblyDifferentName
source: The assembly names are different to compare its version.
es: Los nombres de los ensambles son distintos, para que se pueda comparar su versión.
