Repository: ANamelessWolf/RivieraModulador
Catalog: ModEnfasisPlus/NamelessOld/Libraries/HoukagoTeaTime/Assets/Errors.*.resx
Languages: es

# BadDictionaryKey
source: The dictionary entry key has an invalid name.
es: La llave del diccionario no es nombre valido.

# BadValueforLine
source: The given value doesn't satisfy the current equation,
es: El valor proporcionado para la recta no satisface la ecuación,

# BlockFileMissing
source: The dwg file doesn't exist, check the filepath:
es: El archivo dwg, no existe. Revise la ruta:

# BlockNameMissing
source: Can not insert the block, the block is missing. Undefined,
es: No se puede insertar el bloque. El nombre del bloque no existe. Bloque desconocido,

# CanNotBeErased
source: The selected DbObject can not be erased.
es: No se puede eliminar el DbObject seleccionado.

# CanNotBeMovedToLayer
source: The object can not be move to the layer {0}.
es: El elemento no se puede mover a la capa {0}.

# CanNotBeSummonedAsEntity
source: One or more element can not be summoned as an entity.
es: Uno o más elementos no pueden ser invocados como entidad.

# CanNotCastAnEntity
source: Error doing the casting beetween entities.
es: No se puede realizar el casting.

# CanNotClosePolyline
source: The selected polyline couldn't be close.
es: La poli-línea seleccionada no se pudo cerrar.

# CanNotCreateLayer
source: The layer can't be created
es: No se pudo crear la capa.

# CanNotDraw
source: The entity couldn't be draw.
es: La entidad no se puede dibujar.

# CanNotExtractAttributeValue
source: Can not extract the attribute value.
es: No se puede extraer el valor del atributo.

# CanNotFlipPl
source: The polyline can not be flipped.
es: Error al tratar de invertir el sentido de la poli-línea.

# CanNotSummonAnEntity
source: Can not get the entity.
es: No se puede acceder a la entidad.

# CanNotSummonAnObject
source: Can not get the object.
es: No se puede acceder al objeto.

# CanNotUpdateProperty
source: Can not update the entity properties.
es: No se puede actualizar, las propiedades de la entidad seleccionada.

# ErrorAddingTypedValues
source: The typed values failed to be added to an XRecord.
es: No se pudieron agregar los valores al Xrecord.

# ErrorCreatingDictionary
source: Couldn't create a new dictionary.
es: No se pudo crear el diccionario.

# ErrorCreatingExtensionDictionary
source: Couldn't create a extension dictionary.
es: No se puede crear el diccionario de extensión en la entidad.

# ErrorCreatingXRecord
source: Couldn't create a new XRecord.
es: No se pudo crear el XRecord.

# ErrorDefieneS0PulseWave
source: Error trying to define the initial state of the pulse generator automata.
es: Error al tratar de definir el estado s0, del automata para generar pulsos.

# ErrorDefieneS1PulseWave
source: Error trying to define the state s1 of the pulse generator automata.
es: Error al tratar de definir el estado s1, del automata para generar pulsos.

# ErrorDefieneS2PulseWave
source: Error trying to define the state s2 of the pulse generator automata.
es: Error al tratar de definir el estado s2, del automata para generar pulsos.

# ErrorDestroyingExtDictionary
source: Error trying to release the extension dictionary of the application.
es: Error al tratar de eliminar el diccionario de extensión de la entidad,

# ErrorExtractingParamValue
source: Error trying to extract the string parameters.
es: Error al tratar de extraes los valores del parametro.

# ErrorInsertingBlockReference
source: Error trying to insert the block reference.
es: Error al tratar de insertar el bloque.

# ErrorReadingXData
source: Error trying to read the XData information
es: Error al tratar de leer la información en la propiedad XDATA

# ErrorReadingXrecord
source: Error trying to read the XRecord, be sure that the XRecord exists before trying to read it.
es: Error al tratar de leer el Xrecord, asegurese que exista el registro antes de intentar leerlo.

# ErrorStateMsg
source: Error found, in the error message.
es: Se encontro un error al recorrer el automata.

# ExtDictionaryCreated
source: The extension dictionary is now avaible for the entity with Handle,
es: El diccionario de extensión ha sido creado para la entidad,

# ExtensionDictionaryIsReleased
source: The extension dictionary was released from the current entity.
es: El diccionario fue removido de la entidad seleccionada.

# FailedGetCurrentLayer
source: Failed to read the current layer.
es: Error al tratar de leer la capa actual.

# FailedSetCurrentLayer
source: Failed to select the layer as current one.
es: Error al tratar de establecer la capa como la capa actual.

# FailedToGetLayerStatus
source: Failed to get the layer status
es: Error al tratar de extraer el status actual de la capa

# FailedToListLayers
source: Failed to list the layers of the current drawing.
es: Error al listar las capas del dibujo actual.

# FailedToUpdateFreezeStatus
source: Failed to update the freeze status of the selected layers.
es: Error al tratar de actualizar el estado de congelamiento de las capas seleccionadas.

# FailedToUpdateHiddenStatus
source: Failed to update the hidden status of the selected layers.
es: Error al tratar de actualizar el estado de visibilidad de las capas seleccionadas.

# FailedToUpdateLayer
source: Failed to update an entity layer
es: Hubo un error al cambiarle la capa a una entidad.

# FailedToUpdateLockStatus
source: Failed to update the lock status of the selected layers.
es: Error al tratar de actualizar el estado de seguridad de las capas seleccionadas.

# FailedToUpdateStatus
source: Failed to update the status of the layers.
es: Error al tratar de actualizar el estado de la capa seleccionadas

# ImposibleToRunCMD
source: Error at run the command
es: Error al ejecutar el comando

# InvalidLayerName
source: The layer name is empty or is invalid, the layer name must not include the following characters: <>\":;?|,='`
es: El nombre de la capa esta vacio o el nombre de la capa no es válido. El nombre de la capa no debe utilizar los siguientes caracteres: <>\":;?|,='`

# InvalidRegionElements
source: The collection of elements are not valid to create a region.
es: La colección de elementos no es válida para crear una región.

# Line2dNotZSupported
source: The 2d line is not supported for the Z-axis
es: Una línea 2d no soporta ser constante en el eje Z.

# NewDataAddedXData
source: New data has been added or updated to the XData of the entity
es: Nueva información ha sido agregada o actualizada al registro de XDATA de la entidad seleccionado.

# NewDataAddedXrecord
source: New data has been added or updated to the XRecord.
es: Nueva información ha sido agregada o actualizada al registro seleccionado.

# NewDictionaryAdded
source: A new dictionary is created named,
es: Se agregó un nuevo diccionario con nombre,

# NewRegAppRecord
source: A new RegApp Record is created in the RegAppTable
es: Un nuevo registro se agregado en la tabla de RegApp de AutoCAD.

# NewXRecordAdded
source: A new xRecord is created named,
es: Se agregó un nuevo Xrecord con nombre,

# NotAnEntity
source: The element is not an entity.
es: El elemento no es una entidad.

# NotASegment
source: The given value is not a segment.
es: El valor proporcionado no es un segmento

# NotCorrectData
source: The selected entity doesn't match the requested type, select an entity of the following type:
es: El elemento seleccionado no es del tipo solicitado seleccione un elemento del tipo:

# PolylineIsNotAPulse
source: The selected polyline doesn't contains a pulse wave geometry. A pulse is made of segments, each segment has the same size and has only straight angles.
es: La geometría de la poli línea seleccionada no coincide con la geometría de un pulso. Un pulso esta formado por segmentos, cada segmento del pulso mide lo mismo y tienen solo angulos rectos.

# ReadingBlockTable
source: Error Reading Block Table Record.
es: Error al leer la tabla de bloques.

# RemovingDictionary
source: Error trying to remove the dictionary.
es: Error al tratar de remover el diccionario.

# RemovingXRecord
source: Error trying to remove the XRecord.
es: Error al tratar de remover el XRecord.

# SelectionTypeNotSupported
source: The selection type is not supported.
es: El tipo de selección no esta soportado.

# Transaction
source: Error en la transacción
es: Transaction error

# ValueIsOutOfSegment
source: The given value is out of the bounds of the segment.
es: El valor proporcionado se encuentra fuera de los límites del segmento.

# VerifyingExistance
source: Error veryfing the existance of the dictionary.
es: Error al tratar de verificar la existencia del diccionario seleccionado.

# BlockTableRecordMissing
source: The name {0} does not exists in the block table record
es: El nombre {0} no existe en la tabla de bloques.

# CreatingPolylineGeometry
source: Error creating the polyline geometry
es: Error al crear la geometría de la poli-línea

# FailedToGetLayerColor
source: Failed to read the layer color.
es: Error al tratar de leer el color de la capa.

# EntityCanNotBeTagged
source: The entity can not be tagged
es: La entidad no puede ser etiquetada

# EntityCanNotBeTransform
source: One or more entities can not be transform
es: Una o más entidades no pueden ser transformadas

source: Invalid point comparation
es: Comparación de punto no permitida

# FailedToTransform
source: Error transforming the entity
es: Error al transformar la entidad

# BadTabSize
source: The number of tabs must be equally to the number of controsl, add more strings to the Tabs property or remove strings, to match the controls size.
es: El número de pestañas debe ser igual al número de controles, elimine cadenas o agregue cadenas en la propiedad Tabs, para que iguale el tamaño del arreglo de "control".

# CanNotCreateBlock
source: The block can not be created
es: El bloque no puede ser creado

# NotADictionary
source: The element is not a DBDictionary
es: El elemento no es un DBDictionary

# NotAXRecord
source: The element is not a XRecord
es: El elemento no es un XRecord

# ErrorReadingDictionary
source: Error trying to read the Dictionary, be sure that the dictionary exists before trying to read it.
es: Error al tratar de leer el diccionario, asegurese que exista el diccionario antes de intentar leerlo.

# BadId
source: The id is not valid.
es: El id es invalido
